{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.5", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "batch_input_shape": [null, 5005], "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "units": 1024, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.7, "noise_shape": null, "dtype": "float32", "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "units": 512, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "rate": 0.7, "noise_shape": null, "dtype": "float32", "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "units": 128, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "activation": "sigmoid", "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null, "units": 1, "kernel_regularizer": null}}]}}