{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 15], "trainable": true, "activity_regularizer": null, "input_length": 15, "embeddings_constraint": null, "input_dim": 450, "name": "embedding_2", "mask_zero": false, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}}}, {"class_name": "Conv1D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3], "activation": "relu", "kernel_regularizer": null, "strides": [1], "trainable": true, "padding": "same", "activity_regularizer": null, "use_bias": true, "filters": 32, "bias_constraint": null, "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dilation_rate": [1], "bias_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_2", "pool_size": [8], "strides": [8], "trainable": true, "padding": "same"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "units": 6, "bias_regularizer": null}}]}